"""
a = {
            '31': '上海市', '32': '江苏省', '33': '浙江省', '34': '安徽省', '35': '福建省', '36': '江西省', '37': '山东省',
            '41': '河南省', '42': '湖北省', '43': '湖南省',
            '44': '广东省', '45': '广西壮族自治区', '46': '海南省',
            '50': '重庆市', '51': '四川省', '52': '贵州省', '53': '云南省', '54': '西藏自治区',
            '61': '陕西省', '62': '甘肃省', '63': '青海省', '64:': '宁夏回族自治区', '65': '新疆维吾尔自治区',
            '83': '台湾省', '81': '香港特别行政区', '82': '澳门特别行政区'
   }

x = input('请输入身份证信息：')
print('出生日期：'+x[6:14])
c = int(x[16])
if c % 2 == 0:
    print('性别：女')
else:
    print('性别：男')
b = x[0:2]
if b in a:
    print('您所在的省份为：'+a[b])
"""
import re
a = '张三喜欢看黑客方面的图书，想要窃取别人的信息!'
b = '我是一名程序员，我喜欢Python方面的图书，喜欢开发网站'
print(re.sub('黑客|窃取|监听', '***', a))
print(re.sub('黑客|窃取|监听', '***', b))
